MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX270F512L.PIC
      <edc:SFRDef edc:_addr="0x1F80FC70" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="93" edc:access="----------------------------nnnn" edc:cname="RPF12R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPF12R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPF12R" edc:desc="" edc:mask="0xf" edc:name="RPF12R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC74" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="94" edc:access="----------------------------nnnn" edc:cname="RPF13R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPF13R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPF13R" edc:desc="" edc:mask="0xf" edc:name="RPF13R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC78" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="95" edc:access="----------------------------nnnn" edc:cname="RPF14R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPF14R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPF14R" edc:desc="" edc:mask="0xf" edc:name="RPF14R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC7C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="96" edc:access="----------------------------nnnn" edc:cname="RPF15R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPF15R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPF15R" edc:desc="" edc:mask="0xf" edc:name="RPF15R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC80" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="97" edc:access="----------------------------nnnn" edc:cname="RPG0R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPG0R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPG0R" edc:desc="" edc:mask="0xf" edc:name="RPG0R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC84" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="98" edc:access="----------------------------nnnn" edc:cname="RPG1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPG1R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPG1R" edc:desc="" edc:mask="0xf" edc:name="RPG1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC88" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="99" edc:access="----------------------------nnnn" edc:cname="RPG2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPG2R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPG2R" edc:desc="" edc:mask="0xf" edc:name="RPG2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC8C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="100" edc:access="----------------------------nnnn" edc:cname="RPG3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPG3R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPG3R" edc:desc="" edc:mask="0xf" edc:name="RPG3R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC90" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="101" edc:access="----------------------------nnnn" edc:cname="RPG4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPG4R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPG4R" edc:desc="" edc:mask="0xf" edc:name="RPG4R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC94" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="102" edc:access="----------------------------nnnn" edc:cname="RPG5R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPG5R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPG5R" edc:desc="" edc:mask="0xf" edc:name="RPG5R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC98" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="103" edc:access="----------------------------nnnn" edc:cname="RPG6R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPG6R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPG6R" edc:desc="" edc:mask="0xf" edc:name="RPG6R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FC9C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="104" edc:access="----------------------------nnnn" edc:cname="RPG7R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPG7R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPG7R" edc:desc="" edc:mask="0xf" edc:name="RPG7R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FCA0" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="105" edc:access="----------------------------nnnn" edc:cname="RPG8R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPG8R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPG8R" edc:desc="" edc:mask="0xf" edc:name="RPG8R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FCA4" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="106" edc:access="----------------------------nnnn" edc:cname="RPG9R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPG9R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPG9R" edc:desc="" edc:mask="0xf" edc:name="RPG9R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FCA8" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-02495_RPORx.Module" edc:_refcount="107" edc:access="----------------------------nnnn" edc:cname="RPG10R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="RPG10R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPG10R" edc:desc="" edc:mask="0xf" edc:name="RPG10R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="28"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
